//* Github это удаленный репозиторий
//* Работа с удаленным репозиторием нужна для командной работы или же работы на нескольких устройствах
//* git 
        //* - status    = показывает статус репозитория
        //* - add       = добавляет изменения на индексацию
        //* - log       = показывает данные о всех комитах
        //* - clone     = клонирует удаленный репозиторий на устройство
        //* - pull      = перетаскивает все изменения с удаленного репозитория
        //* - push      = сохраняет все локальные изменения в удаленном репозитории
        //* - merge     = слияние изменений в локальном и тоже время изменения удаленном репозитории


//* .gitignore -  файл предназначен для игнорирование определенных файлов
