//*   =   - операатор присваивания
//*   +   - оператор сложение
//*   -   - оператор вычитания
//*   *   - оператор умножения
//*   /   - оператор деления
//*   %   - оператор деление от остатка. Например:  8 % 3   // 2
//*   **  - оператор возведения в степень. Например: 2 ** 3   // 8
//*   +унарный   - оператор приведение к числовому типу. 
//*                                                     Например:  let x = "1";
//*                                                                console.log(+x)    // 1  <--Число
//*                                                                 или более длинное написание Number(x)
//*   -унарный   - тот же оператор +унарного но уже со знаком -


//* Порядок выполнения операторов
//* Смотри на странице  https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Operator_Precedence
